mdmfile/src/Catalogs/мдмБизнесПроцессы/мдмБизнесПроцессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмБизнесПроцессы</name>
  <basedOn>Catalog.мдмСхемыДанных</basedOn>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаДанных</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДанных</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСписка</name>
    <type>
      <types>CatalogRef.мдмНастройкиСписков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредмета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяМетаданныхПредмета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДанныхБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиСтарт/мдмТочкиСтарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиСтарт</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>ПередСтартом</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Выходы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмБизнесПроцессы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТочкаСтарт(БизнесПроцесс) Экспорт
	
	Перем Точка;
	
	Выборка = Справочники.мдмТочкиСтарт.Выбрать(, БизнесПроцесс);
	Если Выборка.Следующий() тогда
		Точка = Выборка.Ссылка;
	Иначе 
		ВызватьИсключение "Не найдена точка страта.";
	КонецЕсли;	
		
	Возврат Точка;
	
КонецФункции	

Функция ПроверитьСхему(БизнесПроцесс) Экспорт
	
	Результат = Истина;
	
	Карта = БизнесПроцесс.Карта.Получить();
	
	Если Карта = Неопределено тогда
		
		Сообщить("Не настроена карта маршрута.");
		
		Результат = Ложь;
		
	Иначе 	
		
		Для Каждого ЭлементСхемы из Карта.ЭлементыГрафическойСхемы цикл
			
			Если ТипЗнч(ЭлементСхемы) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") 
				ИЛИ ТипЗнч(ЭлементСхемы) = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния") тогда	
				
				Продолжить;
				
			КонецЕсли;
			
			МенеджерТочки = мдмТочкиБизнесПроцесса.МенеджерТочки(ЭлементСхемы);
			
			Точка = МенеджерТочки.ПолучитьПоИмени(ЭлементСхемы.Имя, БизнесПроцесс);
			
			Если ЗначениеЗаполнено(Точка) тогда
				
				Результат = Результат И Точка.ПолучитьОбъект().ПроверитьТочку();
				
			Иначе 
				
				Результат = Ложь;
				
				Сообщить("Точка схемы " + ЭлементСхемы.Наименование + " не настроена.");
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
